ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra.c
        case CY_PRA_MSG_TYPE_REG32_SET:
            if (0U == (message->praData1 & regIndexToAddr[message->praIndex].writeMask))
            {
                CY_SET_REG32(regIndexToAddr[message->praIndex].addr, message->praData1);
                message->praStatus = CY_PRA_STATUS_SUCCESS;
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        case CY_PRA_MSG_TYPE_REG32_GET:
            message->praData1 = CY_GET_REG32(regIndexToAddr[message->praIndex].addr);
            message->praStatus = CY_PRA_STATUS_SUCCESS;
            break;

        case CY_PRA_MSG_TYPE_CM0_WAKEUP:
            message->praStatus = CY_PRA_STATUS_SUCCESS;
            break;

        case CY_PRA_MSG_TYPE_SYS_CFG_FUNC:
            CY_ASSERT_L1((cy_stc_pra_system_config_t *)(message->praData1) != NULL);
            if( NULL != (cy_stc_pra_system_config_t *)(message->praData1))
            {
                structCpy = *((cy_stc_pra_system_config_t *)(message->praData1));
                message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                if((CY_PRA_STRUCT_NOT_INITIALIZED == structInit) && (CY_PRA_STATUS_SUCCESS == message->praStatus))
                {
                    structInit = CY_PRA_STRUCT_INITIALIZED;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_INVALID_PARAM;
            }
            break;

        case CY_PRA_MSG_TYPE_SECURE_ONLY:
            switch (message->praIndex)
            {
                case CY_PRA_PM_FUNC_HIBERNATE:
                    Cy_PRA_PmHibernate(message->praData1);
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_PM_FUNC_CM4_DP_FLAG_SET:
                    Cy_PRA_PmCm4DpFlagSet();
                    message->praStatus = CY_PRA_STATUS_SUCCESS;
                    break;

                case CY_PRA_CLK_FUNC_DS_BEFORE_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSBeforeTransition();
                    break;

                case CY_PRA_CLK_FUNC_DS_AFTER_TRANSITION:
                    message->praStatus = Cy_PRA_ClkDSAfterTransition();
                    break;

                default:
                    message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                    break;
            }
            break;

        case CY_PRA_MSG_TYPE_FUNC_POLICY:
            if(CY_PRA_STRUCT_NOT_INITIALIZED != structInit)
            {
                switch (message->praIndex)
                {
                    case CY_PRA_PM_FUNC_LDO_SET_VOLTAGE:
                    {
                        bool powerEnableTmp, ldoEnableTmp, ulpEnableTmp;
                        powerEnableTmp = structCpy.powerEnable; /* old value backup */
                        ldoEnableTmp = structCpy.ldoEnable; /* old value backup */
                        ulpEnableTmp = structCpy.ulpEnable; /* old value backup */
                        structCpy.powerEnable = true;
                        structCpy.ldoEnable = true;
                        structCpy.ldoVoltage = (cy_en_syspm_ldo_voltage_t)message->praData1;
                        if (structCpy.ldoVoltage == CY_SYSPM_LDO_VOLTAGE_0_9V)
                        {
                            structCpy.ulpEnable = true;
                        }
                        else
                        {
                            structCpy.ulpEnable = false;
                        }
                        message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                        if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                        {
                            /* On failure restored previous values */
                            structCpy.powerEnable = powerEnableTmp;
                            structCpy.ldoEnable = ldoEnableTmp;
                            structCpy.ulpEnable = ulpEnableTmp;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_BUCK_ENABLE:
                    {
                        bool powerEnableTmp, ldoEnableTmp, ulpEnableTmp;
                        powerEnableTmp = structCpy.powerEnable; /* old value backup */
                        ldoEnableTmp = structCpy.ldoEnable; /* old value backup */
                        ulpEnableTmp = structCpy.ulpEnable; /* old value backup */
                        structCpy.powerEnable = true;
                        structCpy.ldoEnable = false;
                        structCpy.buckVoltage = (cy_en_syspm_buck_voltage1_t)message->praData1;
                        if (structCpy.buckVoltage == CY_SYSPM_BUCK_OUT1_VOLTAGE_0_9V)
                        {
                            structCpy.ulpEnable = true;
                        }
                        else
                        {
                            structCpy.ulpEnable = false;
                        }
                        message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                        if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                        {
                            /* On failure restored previous values */
                            structCpy.powerEnable = powerEnableTmp;
                            structCpy.ldoEnable = ldoEnableTmp;
                            structCpy.ulpEnable = ulpEnableTmp;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_SET_MIN_CURRENT:
                    {
                        bool powerEnableTmp, pwrCurrentModeMinTmp;
                        /* Backup old values */
                        powerEnableTmp = structCpy.powerEnable;
                        pwrCurrentModeMinTmp = structCpy.pwrCurrentModeMin;
                        structCpy.powerEnable = true;
                        structCpy.pwrCurrentModeMin = true;
                        message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                        if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                        {
                            /* On failure restored previous values */
                            structCpy.powerEnable = powerEnableTmp;
                            structCpy.pwrCurrentModeMin = pwrCurrentModeMinTmp;
                        }
                    }
                    break;

                    case CY_PRA_PM_FUNC_SET_NORMAL_CURRENT:
                    {
                        bool powerEnableTmp, pwrCurrentModeMinTmp;
                        /* Backup old values */
                        powerEnableTmp = structCpy.powerEnable;
                        pwrCurrentModeMinTmp = structCpy.pwrCurrentModeMin;
                        structCpy.powerEnable = true;
                        structCpy.pwrCurrentModeMin = false;
                        message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                        if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                        {
                            /* On failure restored previous values */
                            structCpy.powerEnable = powerEnableTmp;
                            structCpy.pwrCurrentModeMin = pwrCurrentModeMinTmp;
                        }
                    }
                    break;

