ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra.c
                    case CY_PRA_CLK_FUNC_WCO_BYPASS:
                    {
                        bool bypassEnableTmp;
                        /* Backup old values */
                        bypassEnableTmp = structCpy.bypassEnable;
                        structCpy.bypassEnable = ((cy_en_wco_bypass_modes_t) message->praData1 == CY_SYSCLK_WCO_BYPASSED) ? true : false;
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                        /* Bypass value will be written to REGISTER only when WCO is enabled */
                        if (structCpy.wcoEnable)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure restored previous values */
                                structCpy.bypassEnable = bypassEnableTmp;
                            }
                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_HF_ENABLE:
                    {
                        bool clkHFEnable;
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                        /* Backup old values */
                        switch (message->praData1)
                        {
                            case CY_PRA_CLKHF_0:
                            clkHFEnable = structCpy.clkHF0Enable;
                            structCpy.clkHF0Enable = true;
                            break;

                            case CY_PRA_CLKHF_1:
                            clkHFEnable = structCpy.clkHF1Enable;
                            structCpy.clkHF1Enable = true;
                            break;

                            case CY_PRA_CLKHF_2:
                            clkHFEnable = structCpy.clkHF2Enable;
                            structCpy.clkHF2Enable = true;
                            break;

                            case CY_PRA_CLKHF_3:
                            clkHFEnable = structCpy.clkHF3Enable;
                            structCpy.clkHF3Enable = true;
                            break;

                            case CY_PRA_CLKHF_4:
                            clkHFEnable = structCpy.clkHF4Enable;
                            structCpy.clkHF4Enable = true;
                            break;

                            case CY_PRA_CLKHF_5:
                            clkHFEnable = structCpy.clkHF5Enable;
                            structCpy.clkHF5Enable = true;
                            break;

                            default:
                            clkHFEnable = false;
                            message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                            break;

                        }
                        if (message->praStatus == CY_PRA_STATUS_SUCCESS)
                        {
                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                /* On failure restored previous values */
                                switch (message->praData1)
                                {
                                    case CY_PRA_CLKHF_0:
                                    structCpy.clkHF0Enable = clkHFEnable;
                                    break;

                                    case CY_PRA_CLKHF_1:
                                    structCpy.clkHF1Enable = clkHFEnable;
                                    break;

                                    case CY_PRA_CLKHF_2:
                                    structCpy.clkHF2Enable = clkHFEnable;
                                    break;

                                    case CY_PRA_CLKHF_3:
                                    structCpy.clkHF3Enable = clkHFEnable;
                                    break;

                                    case CY_PRA_CLKHF_4:
                                    structCpy.clkHF4Enable = clkHFEnable;
                                    break;

                                    case CY_PRA_CLKHF_5:
                                    structCpy.clkHF5Enable = clkHFEnable;
                                    break;

                                    default:
                                    break;
                                }
                            }
                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_HF_DISABLE:
                    {
                        bool clkHFEnable;
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                        /* Backup old values */
                        switch (message->praData1)
                        {
                            case CY_PRA_CLKHF_0:
                            clkHFEnable = structCpy.clkHF0Enable;
                            structCpy.clkHF0Enable = false;
                            break;

                            case CY_PRA_CLKHF_1:
                            clkHFEnable = structCpy.clkHF1Enable;
                            structCpy.clkHF1Enable = false;
                            break;

                            case CY_PRA_CLKHF_2:
                            clkHFEnable = structCpy.clkHF2Enable;
                            structCpy.clkHF2Enable = false;
                            break;

                            case CY_PRA_CLKHF_3:
                            clkHFEnable = structCpy.clkHF3Enable;
                            structCpy.clkHF3Enable = false;
                            break;

                            case CY_PRA_CLKHF_4:
                            clkHFEnable = structCpy.clkHF4Enable;
                            structCpy.clkHF4Enable = false;
                            break;

                            case CY_PRA_CLKHF_5:
                            clkHFEnable = structCpy.clkHF5Enable;
                            structCpy.clkHF5Enable = false;
                            break;

                            default:
                            clkHFEnable = false;
                            message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                            break;

