ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/source/cy_pra.c
                    case CY_PRA_CLK_FUNC_PLL_ENABLE:
                    {
                        if ((((message->praData1) == CY_PRA_CLKPLL_1) && (structCpy.pll0Enable == true))
                            || (((message->praData1) == CY_PRA_CLKPLL_2) && (structCpy.pll1Enable == true))
                            || (message->praData1 > CY_SRSS_NUM_PLL) || (message->praData1 == 0UL))
                        {
                            message->praStatus = CY_PRA_STATUS_ERROR_PROCESSING_PLL_ENABLED;
                        }
                        else
                        {
                            /* PLL Enable API does not contains PLL output value
                             * as argument. So calculate and update PLL output value */
                            if ((message->praData1) == CY_PRA_CLKPLL_1)
                            {
                                structCpy.pll0OutFreqHz = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_1, &structCpy);
                                structCpy.pll0Enable = true;
                            }
                            else
                            {
                                structCpy.pll1OutFreqHz = Cy_PRA_CalculatePLLOutFreq(CY_PRA_CLKPLL_2, &structCpy);
                                structCpy.pll1Enable = true;
                            }

                            message->praStatus = Cy_PRA_SystemConfig(&structCpy);

                            if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                            {
                                if ((message->praData1) == CY_PRA_CLKPLL_1)
                                {
                                    structCpy.pll0OutFreqHz = CY_PRA_DEFAULT_ZERO;
                                    structCpy.pll0Enable = false;
                                }
                                else
                                {
                                    structCpy.pll1OutFreqHz = CY_PRA_DEFAULT_ZERO;
                                    structCpy.pll1Enable = false;
                                }
                            }
                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_SLOW_SET_DIVIDER:
                    {
                        uint8_t clkSlowDivTmp;
                        bool clkSlowEnableTmp;
                        /* Backup old values */
                        clkSlowEnableTmp = structCpy.clkSlowEnable;
                        clkSlowDivTmp = structCpy.clkSlowDiv;
                        structCpy.clkSlowEnable = true;
                        structCpy.clkSlowDiv = (uint8_t)(message->praData1);
                        message->praStatus = Cy_PRA_SystemConfig(&structCpy);
                        if (message->praStatus != CY_PRA_STATUS_SUCCESS)
                        {
                            /* On failure restored previous path values */
                            structCpy.clkSlowDiv = clkSlowDivTmp;
                            structCpy.clkSlowEnable = clkSlowEnableTmp;
                        }
                    }
                    break;

                    case CY_PRA_CLK_FUNC_EXT_CLK_SET_FREQUENCY:
                    {
                        structCpy.extClkFreqHz = (uint32_t)(message->praData1);
                        message->praStatus = CY_PRA_STATUS_SUCCESS;
                    }
                    break;

                    default:
                        message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
                        break;
                }
            }
            else
            {
                message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
            }
            break;

        default:
            message->praStatus = CY_PRA_STATUS_ACCESS_DENIED;
           break;
    }

}
#endif /* (CY_CPU_CORTEX_M0P) */


#if (CY_CPU_CORTEX_M4) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_PRA_SendCmd
****************************************************************************//**
*
* Process and executes the command received from non-secure core.
*
* \param cmd Command to be executed on secure side.
* \param regIndex Index of the function or register depending on command parameter.
* \param clearMask Data send to secure core.
* \param setMask Additional data send to secure core.
*
* \return Status of the command execution. For register read command the read
* value is returned.
*
*******************************************************************************/
cy_en_pra_status_t Cy_PRA_SendCmd(uint16_t cmd, uint16_t regIndex, uint32_t clearMask, uint32_t setMask)
{
    cy_en_pra_status_t status;
    CY_ALIGN(4UL) cy_stc_pra_msg_t ipcMsg;
    IPC_STRUCT_Type *ipcPraBase = Cy_IPC_Drv_GetIpcBaseAddress(CY_IPC_CHAN_PRA);
    uint32_t interruptState;

    ipcMsg.praCommand = cmd;
    ipcMsg.praStatus  = CY_PRA_STATUS_REQUEST_SENT;
    ipcMsg.praIndex   = regIndex;
    ipcMsg.praData1   = clearMask;
    ipcMsg.praData2   = setMask;

    interruptState = Cy_SysLib_EnterCriticalSection();

    while (CY_IPC_DRV_SUCCESS != Cy_IPC_Drv_SendMsgWord(ipcPraBase, CY_PRA_IPC_NOTIFY_INTR, (uint32_t)&ipcMsg))
    {
        /* Try to acquire the PRA IPC structure and pass the arguments */
    }

    /* Checks whether the IPC structure is not locked */
    while (Cy_IPC_Drv_IsLockAcquired(ipcPraBase))
    {
        /* Polls whether the IPC is released */
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    /* Cortex-M0+ has updated ipcMsg variable */

    status = (cy_en_pra_status_t) ipcMsg.praStatus;

    if (CY_PRA_STATUS_ACCESS_DENIED == status)
    {
        CY_HALT();
    }

    if (CY_PRA_MSG_TYPE_SYS_CFG_FUNC == ipcMsg.praCommand)
    {
        SystemCoreClockUpdate();
    }

    if (CY_PRA_MSG_TYPE_REG32_GET == ipcMsg.praCommand)
    {
        status = (cy_en_pra_status_t)ipcMsg.praData1;
    }

    return status;
}
#endif /* (CY_CPU_CORTEX_M4) */


#if (CY_CPU_CORTEX_M0P) || defined (CY_DOXYGEN)

/* The mask to unlock the Hibernate power mode */
#define HIBERNATE_UNLOCK_VAL                 ((uint32_t) 0x3Au << SRSS_PWR_HIBERNATE_UNLOCK_Pos)

/* The mask to set the Hibernate power mode */
#define SET_HIBERNATE_MODE                   ((HIBERNATE_UNLOCK_VAL |\
                                               SRSS_PWR_HIBERNATE_FREEZE_Msk |\
                                               SRSS_PWR_HIBERNATE_HIBERNATE_Msk))

/* The mask to retain the Hibernate power mode status */
#define HIBERNATE_RETAIN_STATUS_MASK         ((SRSS_PWR_HIBERNATE_TOKEN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk |\
                                               SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk |\
                                               SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk))

/** The mask for the Hibernate wakeup sources */
#define HIBERNATE_WAKEUP_MASK               ((SRSS_PWR_HIBERNATE_MASK_HIBALARM_Msk |\
                                              SRSS_PWR_HIBERNATE_MASK_HIBWDT_Msk |\
                                              SRSS_PWR_HIBERNATE_POLARITY_HIBPIN_Msk |\
                                              SRSS_PWR_HIBERNATE_MASK_HIBPIN_Msk))

/** The define to update the token to indicate the transition into Hibernate */
#define HIBERNATE_TOKEN                    ((uint32_t) 0x1BU << SRSS_PWR_HIBERNATE_TOKEN_Pos)


